pyocd/pyOCD/pyocd/debug/svd/data/HC32L19x.svd
                <register>
                    <name>SQRRESULT5</name>
                    <description>desc SQRRESULT5</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT6</name>
                    <description>desc SQRRESULT6</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT7</name>
                    <description>desc SQRRESULT7</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT8</name>
                    <description>desc SQRRESULT8</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT9</name>
                    <description>desc SQRRESULT9</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT10</name>
                    <description>desc SQRRESULT10</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT11</name>
                    <description>desc SQRRESULT11</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT12</name>
                    <description>desc SQRRESULT12</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQR_RESULT13</name>
                    <description>desc SQR_RESULT13</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT14</name>
                    <description>desc SQRRESULT14</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQRRESULT15</name>
                    <description>desc SQRRESULT15</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JQRRESULT0</name>
                    <description>desc JQRRESULT0</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JQRRESULT1</name>
                    <description>desc JQRRESULT1</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JQRRESULT2</name>
                    <description>desc JQRRESULT2</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JQRRESULT3</name>
                    <description>desc JQRRESULT3</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESULT</name>
                    <description>desc RESULT</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>desc RESULT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESULTACC</name>
                    <description>desc RESULTACC</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESULTACC</name>
                            <description>desc RESULTACC</description>
                            <msb>19</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HT</name>
                    <description>desc HT</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFF</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>HT</name>
                            <description>desc HT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LT</name>
                    <description>desc LT</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>LT</name>
                            <description>desc LT</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFR</name>
                    <description>desc IFR</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>SGLIF</name>
                            <description>desc SGLIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LTIF</name>
                            <description>desc LTIF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTIF</name>
                            <description>desc HTIF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REGIF</name>
                            <description>desc REGIF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SQRIF</name>
                            <description>desc SQRIF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>JQRIF</name>
                            <description>desc JQRIF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
