pyocd/pyOCD/pyocd/debug/svd/data/HC32L19x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TIM1_MODE1</name>
            <description>desc TIM1_MODE1</description>
            <baseAddress>0x40000D00</baseAddress>
            <alternatePeripheral>TIM1_MODE0</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x40</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CNT</name>
                    <description>desc CNT</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M1CR</name>
                    <description>desc M1CR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x600008</resetValue>
                    <resetMask>0x7775</resetMask>
                    <fields>
                        <field>
                            <name>CTEN</name>
                            <description>desc CTEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CT</name>
                            <description>desc CT</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRS</name>
                            <description>desc PRS</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDG1ST</name>
                            <description>desc EDG1ST</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDG2ND</name>
                            <description>desc EDG2ND</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UIE</name>
                            <description>desc UIE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ONESHOT</name>
                            <description>desc ONESHOT</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFR</name>
                    <description>desc IFR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x5</resetMask>
                    <fields>
                        <field>
                            <name>UIF</name>
                            <description>desc UIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CA0F</name>
                            <description>desc CA0F</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICLR</name>
                    <description>desc ICLR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0x5</resetMask>
                    <fields>
                        <field>
                            <name>UIF</name>
                            <description>desc UIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CA0F</name>
                            <description>desc CA0F</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSCR</name>
                    <description>desc MSCR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x18E0</resetMask>
                    <fields>
                        <field>
                            <name>TS</name>
                            <description>desc TS</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IA0S</name>
                            <description>desc IA0S</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IB0S</name>
                            <description>desc IB0S</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLTR</name>
                    <description>desc FLTR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0000077</resetMask>
                    <fields>
                        <field>
                            <name>FLTA0</name>
                            <description>desc FLTA0</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLTB0</name>
                            <description>desc FLTB0</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLTET</name>
                            <description>desc FLTET</description>
                            <msb>30</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ETP</name>
                            <description>desc ETP</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR0</name>
                    <description>desc CR0</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3000</resetValue>
                    <resetMask>0x100</resetMask>
                    <fields>
                        <field>
                            <name>CIEA</name>
                            <description>desc CIEA</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCR0A</name>
                    <description>desc CCR0A</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CCR0A</name>
                            <description>desc CCR0A</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
